
## Plan Result (shareable-lists-api-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/69210)


<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4
  * local_file.application_ecs_service_appspec_94386B9C


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4 will be created
  + resource "aws_ecs_task_definition" "application_ecs_service_ecs-task_461CC9D4" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + cpu                    = 0
                  + environment            = [
                      + {
                          + name  = "ENVIRONMENT"
                          + value = "production"
                        },
                      + {
                          + name  = "EVENT_BUS_NAME"
                          + value = "PocketEventBridge-Prod-Shared-Event-Bus"
                        },
                      + {
                          + name  = "NODE_ENV"
                          + value = "production"
                        },
                      + {
                          + name  = "REDIS_IS_CLUSTER"
                          + value = "true"
                        },
                      + {
                          + name  = "REDIS_IS_TLS"
                          + value = "true"
                        },
                      + {
                          + name  = "REDIS_PRIMARY_ENDPOINT"
                          + value = "shareablelistsapi-prod-serverless-zcx42u.serverless.use1.cache.amazonaws.com"
                        },
                      + {
                          + name  = "REDIS_READER_ENDPOINT"
                          + value = "shareablelistsapi-prod-serverless-zcx42u.serverless.use1.cache.amazonaws.com"
                        },
                    ]
                  + essential              = true
                  + healthCheck            = {
                      + command     = [
                          + "CMD-SHELL",
                          + "curl -f http://localhost:4029/.well-known/apollo/server-health || exit 1",
                        ]
                      + interval    = 15
                      + retries     = 3
                      + startPeriod = 0
                      + timeout     = 5
                    }
                  + image                  = "996905175585.dkr.ecr.us-east-1.amazonaws.com/shareablelistsapi-prod-app:56832f5d5ce5de8b65d29d1fafd592e5175f5584"
                  + logConfiguration       = {
                      + logDriver     = "awslogs"
                      + options       = {
                          + awslogs-group             = "/Backend/ShareableListsApi-Prod/ecs/app"
                          + awslogs-multiline-pattern = "^\\S.+"
                          + awslogs-region            = "us-east-1"
                          + awslogs-stream-prefix     = "ecs"
                        }
                      + secretOptions = []
                    }
                  + mountPoints            = []
                  + name                   = "app"
                  + portMappings           = [
                      + {
                          + containerPort = 4029
                          + hostPort      = 4029
                        },
                    ]
                  + readonlyRootFilesystem = false
                  + secrets                = [
                      + {
                          + name      = "DATABASE_HOST"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:ShareableListsApi-Prod/shareablelistsapi-prod20230207160218618400000003-d1m38d:host::"
                        },
                      + {
                          + name      = "DATABASE_NAME"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:ShareableListsApi-Prod/shareablelistsapi-prod20230207160218618400000003-d1m38d:dbname::"
                        },
                      + {
                          + name      = "DATABASE_PASSWORD"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:ShareableListsApi-Prod/shareablelistsapi-prod20230207160218618400000003-d1m38d:password::"
                        },
                      + {
                          + name      = "DATABASE_PORT"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:ShareableListsApi-Prod/shareablelistsapi-prod20230207160218618400000003-d1m38d:port::"
                        },
                      + {
                          + name      = "DATABASE_URL"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:ShareableListsApi-Prod/shareablelistsapi-prod20230207160218618400000003-d1m38d:database_url::"
                        },
                      + {
                          + name      = "DATABASE_USER"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:ShareableListsApi-Prod/shareablelistsapi-prod20230207160218618400000003-d1m38d:username::"
                        },
                      + {
                          + name      = "SENTRY_DSN"
                          + valueFrom = "arn:aws:ssm:us-east-1:996905175585:parameter/ShareableListsApi/Prod/SENTRY_DSN"
                        },
                    ]
                  + volumesFrom            = []
                },
            ]
        )
      + cpu                      = "512"
      + execution_role_arn       = "arn:aws:iam::996905175585:role/ShareableListsApi-Prod-TaskExecutionRole"
      + family                   = "ShareableListsApi-Prod"
      + id                       = (known after apply)
      + memory                   = "2048"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = true
      + tags                     = {
          + "environment" = "Prod"
          + "service"     = "ShareableListsApi"
        }
      + tags_all                 = {
          + "environment" = "Prod"
          + "service"     = "ShareableListsApi"
        }
      + task_role_arn            = "arn:aws:iam::996905175585:role/ShareableListsApi-Prod-TaskRole"
      + track_latest             = false
    }

  # local_file.application_ecs_service_appspec_94386B9C will be created
  + resource "local_file" "application_ecs_service_appspec_94386B9C" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "appspec.json"
      + id                   = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobID":"941bff9d-c717-427e-b040-fa7d64184768","JobName":"shareable-lists-api_infrastructure_plan_prod","PRNumber":242,"Program":"tfcmt","SHA1":"56832f5d5ce5de8b65d29d1fafd592e5175f5584","Target":"shareable-lists-api-cdk","Vars":{}} -->